grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIE Channel Interrupt Enable Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIE			MMIO32(XDMAC_BASE + 0x610)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CID Channel Interrupt Disable Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CID			MMIO32(XDMAC_BASE + 0x614)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIM Channel Interrupt Mask Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIM			MMIO32(XDMAC_BASE + 0x618)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CIS Channel Interrupt Status Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CIS			MMIO32(XDMAC_BASE + 0x61c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CSA Channel Source Address Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CSA			MMIO32(XDMAC_BASE + 0x620)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDA Channel Destination Address Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDA			MMIO32(XDMAC_BASE + 0x624)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CNDA Channel Next Descriptor Address Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CNDA			MMIO32(XDMAC_BASE + 0x628)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CNDC Channel Next Descriptor Control Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CNDC			MMIO32(XDMAC_BASE + 0x62c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CUBC Channel Microblock Control Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CUBC			MMIO32(XDMAC_BASE + 0x630)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CBC Channel Block Control Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CBC			MMIO32(XDMAC_BASE + 0x634)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CC Channel Configuration Register **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CC			MMIO32(XDMAC_BASE + 0x638)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDS_MSP Channel Data Stride Memory Set Pattern **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDS_MSP			MMIO32(XDMAC_BASE + 0x63c)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CSUS Channel Source Microblock Stride **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CSUS			MMIO32(XDMAC_BASE + 0x640)
/** XDMAC_XDMAC_CHID[23]_XDMAC_CDUS Channel Destination Microblock Stride **/
#define XDMAC_XDMAC_CHID[23]_XDMAC_CDUS			MMIO32(XDMAC_BASE + 0x644)

/**@}*/


/** @defgroup xdmac_xdmac_gtype XDMACGTYPE Global Type Register
@{*/


#define XDMAC_XDMAC_GTYPE_NB_REQ_SHIFT		16
#define XDMAC_XDMAC_GTYPE_NB_REQ_MASK		0x7f
/** @defgroup xdmac_xdmac_gtype_nb_req NBREQ Number of Peripheral Requests Minus One
@{*/
/**@}*/


#define XDMAC_XDMAC_GTYPE_FIFO_SZ_SHIFT		5
#define XDMAC_XDMAC_GTYPE_FIFO_SZ_MASK		0x7ff
/** @defgroup xdmac_xdmac_gtype_fifo_sz FIFOSZ Number of Bytes
@{*/
/**@}*/


#define XDMAC_XDMAC_GTYPE_NB_CH_SHIFT		0
#define XDMAC_XDMAC_GTYPE_NB_CH_MASK		0x1f
/** @defgroup xdmac_xdmac_gtype_nb_ch NBCH Number of Channels Minus One
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_gcfg XDMACGCFG Global Configuration Register
@{*/

/** XDMAC_XDMAC_GCFG_BXKBEN Boundary X Kilobyte Enable **/
#define XDMAC_XDMAC_GCFG_BXKBEN		(1 << 8)
/** XDMAC_XDMAC_GCFG_CGDISIF Bus Interface Clock Gating Disable **/
#define XDMAC_XDMAC_GCFG_CGDISIF		(1 << 3)
/** XDMAC_XDMAC_GCFG_CGDISFIFO FIFO Clock Gating Disable **/
#define XDMAC_XDMAC_GCFG_CGDISFIFO		(1 << 2)
/** XDMAC_XDMAC_GCFG_CGDISPIPE Pipeline Clock Gating Disable **/
#define XDMAC_XDMAC_GCFG_CGDISPIPE		(1 << 1)
/** XDMAC_XDMAC_GCFG_CGDISREG Configuration Registers Clock Gating Disable **/
#define XDMAC_XDMAC_GCFG_CGDISREG		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gwac XDMACGWAC Global Weighted Arbiter Configuration Register
@{*/


#define XDMAC_XDMAC_GWAC_PW3_SHIFT		12
#define XDMAC_XDMAC_GWAC_PW3_MASK		0x0f
/** @defgroup xdmac_xdmac_gwac_pw3 PW3 Pool Weight 3
@{*/
/**@}*/


#define XDMAC_XDMAC_GWAC_PW2_SHIFT		8
#define XDMAC_XDMAC_GWAC_PW2_MASK		0x0f
/** @defgroup xdmac_xdmac_gwac_pw2 PW2 Pool Weight 2
@{*/
/**@}*/


#define XDMAC_XDMAC_GWAC_PW1_SHIFT		4
#define XDMAC_XDMAC_GWAC_PW1_MASK		0x0f
/** @defgroup xdmac_xdmac_gwac_pw1 PW1 Pool Weight 1
@{*/
/**@}*/


#define XDMAC_XDMAC_GWAC_PW0_SHIFT		0
#define XDMAC_XDMAC_GWAC_PW0_MASK		0x0f
/** @defgroup xdmac_xdmac_gwac_pw0 PW0 Pool Weight 0
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_gie XDMACGIE Global Interrupt Enable Register
@{*/

/** XDMAC_XDMAC_GIE_IE23 XDMAC Channel 23 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE23		(1 << 23)
/** XDMAC_XDMAC_GIE_IE22 XDMAC Channel 22 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE22		(1 << 22)
/** XDMAC_XDMAC_GIE_IE21 XDMAC Channel 21 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE21		(1 << 21)
/** XDMAC_XDMAC_GIE_IE20 XDMAC Channel 20 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE20		(1 << 20)
/** XDMAC_XDMAC_GIE_IE19 XDMAC Channel 19 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE19		(1 << 19)
/** XDMAC_XDMAC_GIE_IE18 XDMAC Channel 18 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE18		(1 << 18)
/** XDMAC_XDMAC_GIE_IE17 XDMAC Channel 17 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE17		(1 << 17)
/** XDMAC_XDMAC_GIE_IE16 XDMAC Channel 16 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE16		(1 << 16)
/** XDMAC_XDMAC_GIE_IE15 XDMAC Channel 15 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE15		(1 << 15)
/** XDMAC_XDMAC_GIE_IE14 XDMAC Channel 14 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE14		(1 << 14)
/** XDMAC_XDMAC_GIE_IE13 XDMAC Channel 13 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE13		(1 << 13)
/** XDMAC_XDMAC_GIE_IE12 XDMAC Channel 12 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE12		(1 << 12)
/** XDMAC_XDMAC_GIE_IE11 XDMAC Channel 11 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE11		(1 << 11)
/** XDMAC_XDMAC_GIE_IE10 XDMAC Channel 10 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE10		(1 << 10)
/** XDMAC_XDMAC_GIE_IE9 XDMAC Channel 9 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE9		(1 << 9)
/** XDMAC_XDMAC_GIE_IE8 XDMAC Channel 8 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE8		(1 << 8)
/** XDMAC_XDMAC_GIE_IE7 XDMAC Channel 7 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE7		(1 << 7)
/** XDMAC_XDMAC_GIE_IE6 XDMAC Channel 6 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE6		(1 << 6)
/** XDMAC_XDMAC_GIE_IE5 XDMAC Channel 5 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE5		(1 << 5)
/** XDMAC_XDMAC_GIE_IE4 XDMAC Channel 4 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE4		(1 << 4)
/** XDMAC_XDMAC_GIE_IE3 XDMAC Channel 3 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE3		(1 << 3)
/** XDMAC_XDMAC_GIE_IE2 XDMAC Channel 2 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE2		(1 << 2)
/** XDMAC_XDMAC_GIE_IE1 XDMAC Channel 1 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE1		(1 << 1)
/** XDMAC_XDMAC_GIE_IE0 XDMAC Channel 0 Interrupt Enable Bit **/
#define XDMAC_XDMAC_GIE_IE0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gid XDMACGID Global Interrupt Disable Register
@{*/

