grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** XDMAC_XDMAC_GID_ID23 XDMAC Channel 23 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID23		(1 << 23)
/** XDMAC_XDMAC_GID_ID22 XDMAC Channel 22 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID22		(1 << 22)
/** XDMAC_XDMAC_GID_ID21 XDMAC Channel 21 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID21		(1 << 21)
/** XDMAC_XDMAC_GID_ID20 XDMAC Channel 20 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID20		(1 << 20)
/** XDMAC_XDMAC_GID_ID19 XDMAC Channel 19 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID19		(1 << 19)
/** XDMAC_XDMAC_GID_ID18 XDMAC Channel 18 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID18		(1 << 18)
/** XDMAC_XDMAC_GID_ID17 XDMAC Channel 17 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID17		(1 << 17)
/** XDMAC_XDMAC_GID_ID16 XDMAC Channel 16 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID16		(1 << 16)
/** XDMAC_XDMAC_GID_ID15 XDMAC Channel 15 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID15		(1 << 15)
/** XDMAC_XDMAC_GID_ID14 XDMAC Channel 14 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID14		(1 << 14)
/** XDMAC_XDMAC_GID_ID13 XDMAC Channel 13 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID13		(1 << 13)
/** XDMAC_XDMAC_GID_ID12 XDMAC Channel 12 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID12		(1 << 12)
/** XDMAC_XDMAC_GID_ID11 XDMAC Channel 11 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID11		(1 << 11)
/** XDMAC_XDMAC_GID_ID10 XDMAC Channel 10 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID10		(1 << 10)
/** XDMAC_XDMAC_GID_ID9 XDMAC Channel 9 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID9		(1 << 9)
/** XDMAC_XDMAC_GID_ID8 XDMAC Channel 8 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID8		(1 << 8)
/** XDMAC_XDMAC_GID_ID7 XDMAC Channel 7 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID7		(1 << 7)
/** XDMAC_XDMAC_GID_ID6 XDMAC Channel 6 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID6		(1 << 6)
/** XDMAC_XDMAC_GID_ID5 XDMAC Channel 5 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID5		(1 << 5)
/** XDMAC_XDMAC_GID_ID4 XDMAC Channel 4 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID4		(1 << 4)
/** XDMAC_XDMAC_GID_ID3 XDMAC Channel 3 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID3		(1 << 3)
/** XDMAC_XDMAC_GID_ID2 XDMAC Channel 2 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID2		(1 << 2)
/** XDMAC_XDMAC_GID_ID1 XDMAC Channel 1 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID1		(1 << 1)
/** XDMAC_XDMAC_GID_ID0 XDMAC Channel 0 Interrupt Disable Bit **/
#define XDMAC_XDMAC_GID_ID0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gim XDMACGIM Global Interrupt Mask Register
@{*/

/** XDMAC_XDMAC_GIM_IM23 XDMAC Channel 23 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM23		(1 << 23)
/** XDMAC_XDMAC_GIM_IM22 XDMAC Channel 22 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM22		(1 << 22)
/** XDMAC_XDMAC_GIM_IM21 XDMAC Channel 21 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM21		(1 << 21)
/** XDMAC_XDMAC_GIM_IM20 XDMAC Channel 20 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM20		(1 << 20)
/** XDMAC_XDMAC_GIM_IM19 XDMAC Channel 19 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM19		(1 << 19)
/** XDMAC_XDMAC_GIM_IM18 XDMAC Channel 18 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM18		(1 << 18)
/** XDMAC_XDMAC_GIM_IM17 XDMAC Channel 17 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM17		(1 << 17)
/** XDMAC_XDMAC_GIM_IM16 XDMAC Channel 16 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM16		(1 << 16)
/** XDMAC_XDMAC_GIM_IM15 XDMAC Channel 15 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM15		(1 << 15)
/** XDMAC_XDMAC_GIM_IM14 XDMAC Channel 14 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM14		(1 << 14)
/** XDMAC_XDMAC_GIM_IM13 XDMAC Channel 13 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM13		(1 << 13)
/** XDMAC_XDMAC_GIM_IM12 XDMAC Channel 12 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM12		(1 << 12)
/** XDMAC_XDMAC_GIM_IM11 XDMAC Channel 11 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM11		(1 << 11)
/** XDMAC_XDMAC_GIM_IM10 XDMAC Channel 10 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM10		(1 << 10)
/** XDMAC_XDMAC_GIM_IM9 XDMAC Channel 9 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM9		(1 << 9)
/** XDMAC_XDMAC_GIM_IM8 XDMAC Channel 8 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM8		(1 << 8)
/** XDMAC_XDMAC_GIM_IM7 XDMAC Channel 7 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM7		(1 << 7)
/** XDMAC_XDMAC_GIM_IM6 XDMAC Channel 6 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM6		(1 << 6)
/** XDMAC_XDMAC_GIM_IM5 XDMAC Channel 5 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM5		(1 << 5)
/** XDMAC_XDMAC_GIM_IM4 XDMAC Channel 4 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM4		(1 << 4)
/** XDMAC_XDMAC_GIM_IM3 XDMAC Channel 3 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM3		(1 << 3)
/** XDMAC_XDMAC_GIM_IM2 XDMAC Channel 2 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM2		(1 << 2)
/** XDMAC_XDMAC_GIM_IM1 XDMAC Channel 1 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM1		(1 << 1)
/** XDMAC_XDMAC_GIM_IM0 XDMAC Channel 0 Interrupt Mask Bit **/
#define XDMAC_XDMAC_GIM_IM0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gis XDMACGIS Global Interrupt Status Register
@{*/

/** XDMAC_XDMAC_GIS_IS23 XDMAC Channel 23 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS23		(1 << 23)
/** XDMAC_XDMAC_GIS_IS22 XDMAC Channel 22 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS22		(1 << 22)
/** XDMAC_XDMAC_GIS_IS21 XDMAC Channel 21 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS21		(1 << 21)
/** XDMAC_XDMAC_GIS_IS20 XDMAC Channel 20 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS20		(1 << 20)
/** XDMAC_XDMAC_GIS_IS19 XDMAC Channel 19 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS19		(1 << 19)
/** XDMAC_XDMAC_GIS_IS18 XDMAC Channel 18 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS18		(1 << 18)
/** XDMAC_XDMAC_GIS_IS17 XDMAC Channel 17 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS17		(1 << 17)
/** XDMAC_XDMAC_GIS_IS16 XDMAC Channel 16 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS16		(1 << 16)
/** XDMAC_XDMAC_GIS_IS15 XDMAC Channel 15 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS15		(1 << 15)
/** XDMAC_XDMAC_GIS_IS14 XDMAC Channel 14 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS14		(1 << 14)
/** XDMAC_XDMAC_GIS_IS13 XDMAC Channel 13 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS13		(1 << 13)
/** XDMAC_XDMAC_GIS_IS12 XDMAC Channel 12 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS12		(1 << 12)
/** XDMAC_XDMAC_GIS_IS11 XDMAC Channel 11 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS11		(1 << 11)
/** XDMAC_XDMAC_GIS_IS10 XDMAC Channel 10 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS10		(1 << 10)
/** XDMAC_XDMAC_GIS_IS9 XDMAC Channel 9 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS9		(1 << 9)
/** XDMAC_XDMAC_GIS_IS8 XDMAC Channel 8 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS8		(1 << 8)
/** XDMAC_XDMAC_GIS_IS7 XDMAC Channel 7 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS7		(1 << 7)
/** XDMAC_XDMAC_GIS_IS6 XDMAC Channel 6 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS6		(1 << 6)
/** XDMAC_XDMAC_GIS_IS5 XDMAC Channel 5 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS5		(1 << 5)
/** XDMAC_XDMAC_GIS_IS4 XDMAC Channel 4 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS4		(1 << 4)
/** XDMAC_XDMAC_GIS_IS3 XDMAC Channel 3 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS3		(1 << 3)
/** XDMAC_XDMAC_GIS_IS2 XDMAC Channel 2 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS2		(1 << 2)
/** XDMAC_XDMAC_GIS_IS1 XDMAC Channel 1 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS1		(1 << 1)
/** XDMAC_XDMAC_GIS_IS0 XDMAC Channel 0 Interrupt Status Bit **/
#define XDMAC_XDMAC_GIS_IS0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_ge XDMACGE Global Channel Enable Register
@{*/

/** XDMAC_XDMAC_GE_EN23 XDMAC Channel 23 Enable Bit **/
#define XDMAC_XDMAC_GE_EN23		(1 << 23)
/** XDMAC_XDMAC_GE_EN22 XDMAC Channel 22 Enable Bit **/
#define XDMAC_XDMAC_GE_EN22		(1 << 22)
/** XDMAC_XDMAC_GE_EN21 XDMAC Channel 21 Enable Bit **/
#define XDMAC_XDMAC_GE_EN21		(1 << 21)
/** XDMAC_XDMAC_GE_EN20 XDMAC Channel 20 Enable Bit **/
#define XDMAC_XDMAC_GE_EN20		(1 << 20)
/** XDMAC_XDMAC_GE_EN19 XDMAC Channel 19 Enable Bit **/
#define XDMAC_XDMAC_GE_EN19		(1 << 19)
/** XDMAC_XDMAC_GE_EN18 XDMAC Channel 18 Enable Bit **/
#define XDMAC_XDMAC_GE_EN18		(1 << 18)
/** XDMAC_XDMAC_GE_EN17 XDMAC Channel 17 Enable Bit **/
#define XDMAC_XDMAC_GE_EN17		(1 << 17)
/** XDMAC_XDMAC_GE_EN16 XDMAC Channel 16 Enable Bit **/
#define XDMAC_XDMAC_GE_EN16		(1 << 16)
/** XDMAC_XDMAC_GE_EN15 XDMAC Channel 15 Enable Bit **/
#define XDMAC_XDMAC_GE_EN15		(1 << 15)
/** XDMAC_XDMAC_GE_EN14 XDMAC Channel 14 Enable Bit **/
#define XDMAC_XDMAC_GE_EN14		(1 << 14)
/** XDMAC_XDMAC_GE_EN13 XDMAC Channel 13 Enable Bit **/
#define XDMAC_XDMAC_GE_EN13		(1 << 13)
/** XDMAC_XDMAC_GE_EN12 XDMAC Channel 12 Enable Bit **/
#define XDMAC_XDMAC_GE_EN12		(1 << 12)
/** XDMAC_XDMAC_GE_EN11 XDMAC Channel 11 Enable Bit **/
#define XDMAC_XDMAC_GE_EN11		(1 << 11)
/** XDMAC_XDMAC_GE_EN10 XDMAC Channel 10 Enable Bit **/
#define XDMAC_XDMAC_GE_EN10		(1 << 10)
/** XDMAC_XDMAC_GE_EN9 XDMAC Channel 9 Enable Bit **/
#define XDMAC_XDMAC_GE_EN9		(1 << 9)
/** XDMAC_XDMAC_GE_EN8 XDMAC Channel 8 Enable Bit **/
#define XDMAC_XDMAC_GE_EN8		(1 << 8)
/** XDMAC_XDMAC_GE_EN7 XDMAC Channel 7 Enable Bit **/
#define XDMAC_XDMAC_GE_EN7		(1 << 7)
/** XDMAC_XDMAC_GE_EN6 XDMAC Channel 6 Enable Bit **/
#define XDMAC_XDMAC_GE_EN6		(1 << 6)
/** XDMAC_XDMAC_GE_EN5 XDMAC Channel 5 Enable Bit **/
#define XDMAC_XDMAC_GE_EN5		(1 << 5)
/** XDMAC_XDMAC_GE_EN4 XDMAC Channel 4 Enable Bit **/
#define XDMAC_XDMAC_GE_EN4		(1 << 4)
/** XDMAC_XDMAC_GE_EN3 XDMAC Channel 3 Enable Bit **/
#define XDMAC_XDMAC_GE_EN3		(1 << 3)
/** XDMAC_XDMAC_GE_EN2 XDMAC Channel 2 Enable Bit **/
#define XDMAC_XDMAC_GE_EN2		(1 << 2)
/** XDMAC_XDMAC_GE_EN1 XDMAC Channel 1 Enable Bit **/
#define XDMAC_XDMAC_GE_EN1		(1 << 1)
/** XDMAC_XDMAC_GE_EN0 XDMAC Channel 0 Enable Bit **/
#define XDMAC_XDMAC_GE_EN0		(1 << 0)

/**@}*/

