grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** @defgroup xdmac_xdmac_gd XDMACGD Global Channel Disable Register
@{*/

/** XDMAC_XDMAC_GD_DI23 XDMAC Channel 23 Disable Bit **/
#define XDMAC_XDMAC_GD_DI23		(1 << 23)
/** XDMAC_XDMAC_GD_DI22 XDMAC Channel 22 Disable Bit **/
#define XDMAC_XDMAC_GD_DI22		(1 << 22)
/** XDMAC_XDMAC_GD_DI21 XDMAC Channel 21 Disable Bit **/
#define XDMAC_XDMAC_GD_DI21		(1 << 21)
/** XDMAC_XDMAC_GD_DI20 XDMAC Channel 20 Disable Bit **/
#define XDMAC_XDMAC_GD_DI20		(1 << 20)
/** XDMAC_XDMAC_GD_DI19 XDMAC Channel 19 Disable Bit **/
#define XDMAC_XDMAC_GD_DI19		(1 << 19)
/** XDMAC_XDMAC_GD_DI18 XDMAC Channel 18 Disable Bit **/
#define XDMAC_XDMAC_GD_DI18		(1 << 18)
/** XDMAC_XDMAC_GD_DI17 XDMAC Channel 17 Disable Bit **/
#define XDMAC_XDMAC_GD_DI17		(1 << 17)
/** XDMAC_XDMAC_GD_DI16 XDMAC Channel 16 Disable Bit **/
#define XDMAC_XDMAC_GD_DI16		(1 << 16)
/** XDMAC_XDMAC_GD_DI15 XDMAC Channel 15 Disable Bit **/
#define XDMAC_XDMAC_GD_DI15		(1 << 15)
/** XDMAC_XDMAC_GD_DI14 XDMAC Channel 14 Disable Bit **/
#define XDMAC_XDMAC_GD_DI14		(1 << 14)
/** XDMAC_XDMAC_GD_DI13 XDMAC Channel 13 Disable Bit **/
#define XDMAC_XDMAC_GD_DI13		(1 << 13)
/** XDMAC_XDMAC_GD_DI12 XDMAC Channel 12 Disable Bit **/
#define XDMAC_XDMAC_GD_DI12		(1 << 12)
/** XDMAC_XDMAC_GD_DI11 XDMAC Channel 11 Disable Bit **/
#define XDMAC_XDMAC_GD_DI11		(1 << 11)
/** XDMAC_XDMAC_GD_DI10 XDMAC Channel 10 Disable Bit **/
#define XDMAC_XDMAC_GD_DI10		(1 << 10)
/** XDMAC_XDMAC_GD_DI9 XDMAC Channel 9 Disable Bit **/
#define XDMAC_XDMAC_GD_DI9		(1 << 9)
/** XDMAC_XDMAC_GD_DI8 XDMAC Channel 8 Disable Bit **/
#define XDMAC_XDMAC_GD_DI8		(1 << 8)
/** XDMAC_XDMAC_GD_DI7 XDMAC Channel 7 Disable Bit **/
#define XDMAC_XDMAC_GD_DI7		(1 << 7)
/** XDMAC_XDMAC_GD_DI6 XDMAC Channel 6 Disable Bit **/
#define XDMAC_XDMAC_GD_DI6		(1 << 6)
/** XDMAC_XDMAC_GD_DI5 XDMAC Channel 5 Disable Bit **/
#define XDMAC_XDMAC_GD_DI5		(1 << 5)
/** XDMAC_XDMAC_GD_DI4 XDMAC Channel 4 Disable Bit **/
#define XDMAC_XDMAC_GD_DI4		(1 << 4)
/** XDMAC_XDMAC_GD_DI3 XDMAC Channel 3 Disable Bit **/
#define XDMAC_XDMAC_GD_DI3		(1 << 3)
/** XDMAC_XDMAC_GD_DI2 XDMAC Channel 2 Disable Bit **/
#define XDMAC_XDMAC_GD_DI2		(1 << 2)
/** XDMAC_XDMAC_GD_DI1 XDMAC Channel 1 Disable Bit **/
#define XDMAC_XDMAC_GD_DI1		(1 << 1)
/** XDMAC_XDMAC_GD_DI0 XDMAC Channel 0 Disable Bit **/
#define XDMAC_XDMAC_GD_DI0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gs XDMACGS Global Channel Status Register
@{*/

/** XDMAC_XDMAC_GS_ST23 XDMAC Channel 23 Status Bit **/
#define XDMAC_XDMAC_GS_ST23		(1 << 23)
/** XDMAC_XDMAC_GS_ST22 XDMAC Channel 22 Status Bit **/
#define XDMAC_XDMAC_GS_ST22		(1 << 22)
/** XDMAC_XDMAC_GS_ST21 XDMAC Channel 21 Status Bit **/
#define XDMAC_XDMAC_GS_ST21		(1 << 21)
/** XDMAC_XDMAC_GS_ST20 XDMAC Channel 20 Status Bit **/
#define XDMAC_XDMAC_GS_ST20		(1 << 20)
/** XDMAC_XDMAC_GS_ST19 XDMAC Channel 19 Status Bit **/
#define XDMAC_XDMAC_GS_ST19		(1 << 19)
/** XDMAC_XDMAC_GS_ST18 XDMAC Channel 18 Status Bit **/
#define XDMAC_XDMAC_GS_ST18		(1 << 18)
/** XDMAC_XDMAC_GS_ST17 XDMAC Channel 17 Status Bit **/
#define XDMAC_XDMAC_GS_ST17		(1 << 17)
/** XDMAC_XDMAC_GS_ST16 XDMAC Channel 16 Status Bit **/
#define XDMAC_XDMAC_GS_ST16		(1 << 16)
/** XDMAC_XDMAC_GS_ST15 XDMAC Channel 15 Status Bit **/
#define XDMAC_XDMAC_GS_ST15		(1 << 15)
/** XDMAC_XDMAC_GS_ST14 XDMAC Channel 14 Status Bit **/
#define XDMAC_XDMAC_GS_ST14		(1 << 14)
/** XDMAC_XDMAC_GS_ST13 XDMAC Channel 13 Status Bit **/
#define XDMAC_XDMAC_GS_ST13		(1 << 13)
/** XDMAC_XDMAC_GS_ST12 XDMAC Channel 12 Status Bit **/
#define XDMAC_XDMAC_GS_ST12		(1 << 12)
/** XDMAC_XDMAC_GS_ST11 XDMAC Channel 11 Status Bit **/
#define XDMAC_XDMAC_GS_ST11		(1 << 11)
/** XDMAC_XDMAC_GS_ST10 XDMAC Channel 10 Status Bit **/
#define XDMAC_XDMAC_GS_ST10		(1 << 10)
/** XDMAC_XDMAC_GS_ST9 XDMAC Channel 9 Status Bit **/
#define XDMAC_XDMAC_GS_ST9		(1 << 9)
/** XDMAC_XDMAC_GS_ST8 XDMAC Channel 8 Status Bit **/
#define XDMAC_XDMAC_GS_ST8		(1 << 8)
/** XDMAC_XDMAC_GS_ST7 XDMAC Channel 7 Status Bit **/
#define XDMAC_XDMAC_GS_ST7		(1 << 7)
/** XDMAC_XDMAC_GS_ST6 XDMAC Channel 6 Status Bit **/
#define XDMAC_XDMAC_GS_ST6		(1 << 6)
/** XDMAC_XDMAC_GS_ST5 XDMAC Channel 5 Status Bit **/
#define XDMAC_XDMAC_GS_ST5		(1 << 5)
/** XDMAC_XDMAC_GS_ST4 XDMAC Channel 4 Status Bit **/
#define XDMAC_XDMAC_GS_ST4		(1 << 4)
/** XDMAC_XDMAC_GS_ST3 XDMAC Channel 3 Status Bit **/
#define XDMAC_XDMAC_GS_ST3		(1 << 3)
/** XDMAC_XDMAC_GS_ST2 XDMAC Channel 2 Status Bit **/
#define XDMAC_XDMAC_GS_ST2		(1 << 2)
/** XDMAC_XDMAC_GS_ST1 XDMAC Channel 1 Status Bit **/
#define XDMAC_XDMAC_GS_ST1		(1 << 1)
/** XDMAC_XDMAC_GS_ST0 XDMAC Channel 0 Status Bit **/
#define XDMAC_XDMAC_GS_ST0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_grs XDMACGRS Global Channel Read Suspend Register
@{*/

/** XDMAC_XDMAC_GRS_RS23 XDMAC Channel 23 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS23		(1 << 23)
/** XDMAC_XDMAC_GRS_RS22 XDMAC Channel 22 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS22		(1 << 22)
/** XDMAC_XDMAC_GRS_RS21 XDMAC Channel 21 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS21		(1 << 21)
/** XDMAC_XDMAC_GRS_RS20 XDMAC Channel 20 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS20		(1 << 20)
/** XDMAC_XDMAC_GRS_RS19 XDMAC Channel 19 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS19		(1 << 19)
/** XDMAC_XDMAC_GRS_RS18 XDMAC Channel 18 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS18		(1 << 18)
/** XDMAC_XDMAC_GRS_RS17 XDMAC Channel 17 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS17		(1 << 17)
/** XDMAC_XDMAC_GRS_RS16 XDMAC Channel 16 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS16		(1 << 16)
/** XDMAC_XDMAC_GRS_RS15 XDMAC Channel 15 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS15		(1 << 15)
/** XDMAC_XDMAC_GRS_RS14 XDMAC Channel 14 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS14		(1 << 14)
/** XDMAC_XDMAC_GRS_RS13 XDMAC Channel 13 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS13		(1 << 13)
/** XDMAC_XDMAC_GRS_RS12 XDMAC Channel 12 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS12		(1 << 12)
/** XDMAC_XDMAC_GRS_RS11 XDMAC Channel 11 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS11		(1 << 11)
/** XDMAC_XDMAC_GRS_RS10 XDMAC Channel 10 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS10		(1 << 10)
/** XDMAC_XDMAC_GRS_RS9 XDMAC Channel 9 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS9		(1 << 9)
/** XDMAC_XDMAC_GRS_RS8 XDMAC Channel 8 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS8		(1 << 8)
/** XDMAC_XDMAC_GRS_RS7 XDMAC Channel 7 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS7		(1 << 7)
/** XDMAC_XDMAC_GRS_RS6 XDMAC Channel 6 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS6		(1 << 6)
/** XDMAC_XDMAC_GRS_RS5 XDMAC Channel 5 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS5		(1 << 5)
/** XDMAC_XDMAC_GRS_RS4 XDMAC Channel 4 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS4		(1 << 4)
/** XDMAC_XDMAC_GRS_RS3 XDMAC Channel 3 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS3		(1 << 3)
/** XDMAC_XDMAC_GRS_RS2 XDMAC Channel 2 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS2		(1 << 2)
/** XDMAC_XDMAC_GRS_RS1 XDMAC Channel 1 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS1		(1 << 1)
/** XDMAC_XDMAC_GRS_RS0 XDMAC Channel 0 Read Suspend Bit **/
#define XDMAC_XDMAC_GRS_RS0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gws XDMACGWS Global Channel Write Suspend Register
@{*/

