grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** XDMAC_XDMAC_GSWS_SWRS23 XDMAC Channel 23 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS23		(1 << 23)
/** XDMAC_XDMAC_GSWS_SWRS22 XDMAC Channel 22 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS22		(1 << 22)
/** XDMAC_XDMAC_GSWS_SWRS21 XDMAC Channel 21 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS21		(1 << 21)
/** XDMAC_XDMAC_GSWS_SWRS20 XDMAC Channel 20 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS20		(1 << 20)
/** XDMAC_XDMAC_GSWS_SWRS19 XDMAC Channel 19 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS19		(1 << 19)
/** XDMAC_XDMAC_GSWS_SWRS18 XDMAC Channel 18 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS18		(1 << 18)
/** XDMAC_XDMAC_GSWS_SWRS17 XDMAC Channel 17 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS17		(1 << 17)
/** XDMAC_XDMAC_GSWS_SWRS16 XDMAC Channel 16 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS16		(1 << 16)
/** XDMAC_XDMAC_GSWS_SWRS15 XDMAC Channel 15 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS15		(1 << 15)
/** XDMAC_XDMAC_GSWS_SWRS14 XDMAC Channel 14 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS14		(1 << 14)
/** XDMAC_XDMAC_GSWS_SWRS13 XDMAC Channel 13 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS13		(1 << 13)
/** XDMAC_XDMAC_GSWS_SWRS12 XDMAC Channel 12 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS12		(1 << 12)
/** XDMAC_XDMAC_GSWS_SWRS11 XDMAC Channel 11 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS11		(1 << 11)
/** XDMAC_XDMAC_GSWS_SWRS10 XDMAC Channel 10 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS10		(1 << 10)
/** XDMAC_XDMAC_GSWS_SWRS9 XDMAC Channel 9 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS9		(1 << 9)
/** XDMAC_XDMAC_GSWS_SWRS8 XDMAC Channel 8 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS8		(1 << 8)
/** XDMAC_XDMAC_GSWS_SWRS7 XDMAC Channel 7 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS7		(1 << 7)
/** XDMAC_XDMAC_GSWS_SWRS6 XDMAC Channel 6 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS6		(1 << 6)
/** XDMAC_XDMAC_GSWS_SWRS5 XDMAC Channel 5 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS5		(1 << 5)
/** XDMAC_XDMAC_GSWS_SWRS4 XDMAC Channel 4 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS4		(1 << 4)
/** XDMAC_XDMAC_GSWS_SWRS3 XDMAC Channel 3 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS3		(1 << 3)
/** XDMAC_XDMAC_GSWS_SWRS2 XDMAC Channel 2 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS2		(1 << 2)
/** XDMAC_XDMAC_GSWS_SWRS1 XDMAC Channel 1 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS1		(1 << 1)
/** XDMAC_XDMAC_GSWS_SWRS0 XDMAC Channel 0 Software Request Status Bit **/
#define XDMAC_XDMAC_GSWS_SWRS0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_gswf XDMACGSWF Global Channel Software Flush Request Register
@{*/

/** XDMAC_XDMAC_GSWF_SWF23 XDMAC Channel 23 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF23		(1 << 23)
/** XDMAC_XDMAC_GSWF_SWF22 XDMAC Channel 22 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF22		(1 << 22)
/** XDMAC_XDMAC_GSWF_SWF21 XDMAC Channel 21 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF21		(1 << 21)
/** XDMAC_XDMAC_GSWF_SWF20 XDMAC Channel 20 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF20		(1 << 20)
/** XDMAC_XDMAC_GSWF_SWF19 XDMAC Channel 19 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF19		(1 << 19)
/** XDMAC_XDMAC_GSWF_SWF18 XDMAC Channel 18 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF18		(1 << 18)
/** XDMAC_XDMAC_GSWF_SWF17 XDMAC Channel 17 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF17		(1 << 17)
/** XDMAC_XDMAC_GSWF_SWF16 XDMAC Channel 16 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF16		(1 << 16)
/** XDMAC_XDMAC_GSWF_SWF15 XDMAC Channel 15 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF15		(1 << 15)
/** XDMAC_XDMAC_GSWF_SWF14 XDMAC Channel 14 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF14		(1 << 14)
/** XDMAC_XDMAC_GSWF_SWF13 XDMAC Channel 13 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF13		(1 << 13)
/** XDMAC_XDMAC_GSWF_SWF12 XDMAC Channel 12 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF12		(1 << 12)
/** XDMAC_XDMAC_GSWF_SWF11 XDMAC Channel 11 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF11		(1 << 11)
/** XDMAC_XDMAC_GSWF_SWF10 XDMAC Channel 10 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF10		(1 << 10)
/** XDMAC_XDMAC_GSWF_SWF9 XDMAC Channel 9 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF9		(1 << 9)
/** XDMAC_XDMAC_GSWF_SWF8 XDMAC Channel 8 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF8		(1 << 8)
/** XDMAC_XDMAC_GSWF_SWF7 XDMAC Channel 7 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF7		(1 << 7)
/** XDMAC_XDMAC_GSWF_SWF6 XDMAC Channel 6 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF6		(1 << 6)
/** XDMAC_XDMAC_GSWF_SWF5 XDMAC Channel 5 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF5		(1 << 5)
/** XDMAC_XDMAC_GSWF_SWF4 XDMAC Channel 4 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF4		(1 << 4)
/** XDMAC_XDMAC_GSWF_SWF3 XDMAC Channel 3 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF3		(1 << 3)
/** XDMAC_XDMAC_GSWF_SWF2 XDMAC Channel 2 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF2		(1 << 2)
/** XDMAC_XDMAC_GSWF_SWF1 XDMAC Channel 1 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF1		(1 << 1)
/** XDMAC_XDMAC_GSWF_SWF0 XDMAC Channel 0 Software Flush Request Bit **/
#define XDMAC_XDMAC_GSWF_SWF0		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cie XDMACCHID[0]XDMACCIE Channel Interrupt Enable Register
@{*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_ROIE Request Overflow Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_ROIE		(1 << 6)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_WBIE Write Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_WBIE		(1 << 5)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_RBIE Read Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_RBIE		(1 << 4)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_FIE End of Flush Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_FIE		(1 << 3)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_DIE End of Disable Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_DIE		(1 << 2)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_LIE End of Linked List Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_LIE		(1 << 1)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIE_BIE End of Block Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIE_BIE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cid XDMACCHID[0]XDMACCID Channel Interrupt Disable Register
@{*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_ROID Request Overflow Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_ROID		(1 << 6)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_WBEID Write Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_WBEID		(1 << 5)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_RBEID Read Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_RBEID		(1 << 4)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_FID End of Flush Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_FID		(1 << 3)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_DID End of Disable Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_DID		(1 << 2)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_LID End of Linked List Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_LID		(1 << 1)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CID_BID End of Block Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CID_BID		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cim XDMACCHID[0]XDMACCIM Channel Interrupt Mask Register
@{*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_ROIM Request Overflow Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_ROIM		(1 << 6)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_WBEIM Write Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_WBEIM		(1 << 5)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_RBEIM Read Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_RBEIM		(1 << 4)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_FIM End of Flush Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_FIM		(1 << 3)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_DIM End of Disable Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_DIM		(1 << 2)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_LIM End of Linked List Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_LIM		(1 << 1)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIM_BIM End of Block Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIM_BIM		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[0]_xdmac_cis XDMACCHID[0]XDMACCIS Channel Interrupt Status Register
@{*/

/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_ROIS Request Overflow Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_ROIS		(1 << 6)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_WBEIS Write Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_WBEIS		(1 << 5)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_RBEIS Read Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_RBEIS		(1 << 4)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_FIS End of Flush Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_FIS		(1 << 3)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_DIS End of Disable Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_DIS		(1 << 2)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_LIS End of Linked List Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_LIS		(1 << 1)
/** XDMAC_XDMAC_CHID[0]_XDMAC_CIS_BIS End of Block Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[0]_XDMAC_CIS_BIS		(1 << 0)

/**@}*/

