grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cid XDMACCHID[3]XDMACCID Channel Interrupt Disable Register
@{*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_ROID Request Overflow Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_ROID		(1 << 6)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_WBEID Write Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_WBEID		(1 << 5)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_RBEID Read Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_RBEID		(1 << 4)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_FID End of Flush Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_FID		(1 << 3)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_DID End of Disable Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_DID		(1 << 2)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_LID End of Linked List Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_LID		(1 << 1)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CID_BID End of Block Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CID_BID		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cim XDMACCHID[3]XDMACCIM Channel Interrupt Mask Register
@{*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_ROIM Request Overflow Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_ROIM		(1 << 6)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_WBEIM Write Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_WBEIM		(1 << 5)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_RBEIM Read Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_RBEIM		(1 << 4)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_FIM End of Flush Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_FIM		(1 << 3)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_DIM End of Disable Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_DIM		(1 << 2)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_LIM End of Linked List Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_LIM		(1 << 1)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIM_BIM End of Block Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIM_BIM		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cis XDMACCHID[3]XDMACCIS Channel Interrupt Status Register
@{*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_ROIS Request Overflow Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_ROIS		(1 << 6)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_WBEIS Write Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_WBEIS		(1 << 5)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_RBEIS Read Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_RBEIS		(1 << 4)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_FIS End of Flush Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_FIS		(1 << 3)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_DIS End of Disable Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_DIS		(1 << 2)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_LIS End of Linked List Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_LIS		(1 << 1)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CIS_BIS End of Block Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CIS_BIS		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_csa XDMACCHID[3]XDMACCSA Channel Source Address Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CSA_SA_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CSA_SA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_csa_sa SA Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cda XDMACCHID[3]XDMACCDA Channel Destination Address Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CDA_DA_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CDA_DA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cda_da DA Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cnda XDMACCHID[3]XDMACCNDA Channel Next Descriptor Address Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDA_SHIFT		2
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDA_MASK		0x3fffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cnda_nda NDA Channel x Next Descriptor Address
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDAIF Channel x Next Descriptor Interface **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDA_NDAIF		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cndc XDMACCHID[3]XDMACCNDC Channel Next Descriptor Control Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDVIEW_SHIFT		3
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDVIEW_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cndc_ndview NDVIEW Channel x Next Descriptor View
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDDUP Channel x Next Descriptor Destination Update **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDDUP		(1 << 2)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDSUP Channel x Next Descriptor Source Update **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDSUP		(1 << 1)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDE Channel x Next Descriptor Enable **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CNDC_NDE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cubc XDMACCHID[3]XDMACCUBC Channel Microblock Control Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CUBC_UBLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CUBC_UBLEN_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cubc_ublen UBLEN Channel x Microblock Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cbc XDMACCHID[3]XDMACCBC Channel Block Control Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CBC_BLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[3]_XDMAC_CBC_BLEN_MASK		0xfff
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cbc_blen BLEN Channel x Block Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc XDMACCHID[3]XDMACCC Channel Configuration Register
@{*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_PERID_SHIFT		24
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_PERID_MASK		0x7f
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_perid PERID Channel x Peripheral Hardware Request Line Identifier
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_WRIP Write in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_WRIP		(1 << 23)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_RDIP Read in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_RDIP		(1 << 22)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_INITD Channel Initialization Terminated (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_INITD		(1 << 21)

#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DAM_SHIFT		18
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_dam DAM Channel x Destination Addressing Mode
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SAM_SHIFT		16
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[3]_xdmac_cc_sam SAM Channel x Source Addressing Mode
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_DIF Channel x Destination Interface Identifier **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_DIF		(1 << 14)
/** XDMAC_XDMAC_CHID[3]_XDMAC_CC_SIF Channel x Source Interface Identifier **/
#define XDMAC_XDMAC_CHID[3]_XDMAC_CC_SIF		(1 << 13)

