grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_ROIE Request Overflow Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_ROIE		(1 << 6)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_WBIE Write Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_WBIE		(1 << 5)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_RBIE Read Bus Error Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_RBIE		(1 << 4)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_FIE End of Flush Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_FIE		(1 << 3)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_DIE End of Disable Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_DIE		(1 << 2)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_LIE End of Linked List Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_LIE		(1 << 1)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIE_BIE End of Block Interrupt Enable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIE_BIE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cid XDMACCHID[7]XDMACCID Channel Interrupt Disable Register
@{*/

/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_ROID Request Overflow Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_ROID		(1 << 6)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_WBEID Write Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_WBEID		(1 << 5)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_RBEID Read Bus Error Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_RBEID		(1 << 4)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_FID End of Flush Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_FID		(1 << 3)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_DID End of Disable Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_DID		(1 << 2)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_LID End of Linked List Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_LID		(1 << 1)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CID_BID End of Block Interrupt Disable Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CID_BID		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cim XDMACCHID[7]XDMACCIM Channel Interrupt Mask Register
@{*/

/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_ROIM Request Overflow Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_ROIM		(1 << 6)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_WBEIM Write Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_WBEIM		(1 << 5)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_RBEIM Read Bus Error Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_RBEIM		(1 << 4)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_FIM End of Flush Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_FIM		(1 << 3)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_DIM End of Disable Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_DIM		(1 << 2)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_LIM End of Linked List Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_LIM		(1 << 1)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIM_BIM End of Block Interrupt Mask Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIM_BIM		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cis XDMACCHID[7]XDMACCIS Channel Interrupt Status Register
@{*/

/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_ROIS Request Overflow Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_ROIS		(1 << 6)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_WBEIS Write Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_WBEIS		(1 << 5)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_RBEIS Read Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_RBEIS		(1 << 4)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_FIS End of Flush Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_FIS		(1 << 3)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_DIS End of Disable Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_DIS		(1 << 2)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_LIS End of Linked List Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_LIS		(1 << 1)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CIS_BIS End of Block Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CIS_BIS		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_csa XDMACCHID[7]XDMACCSA Channel Source Address Register
@{*/


#define XDMAC_XDMAC_CHID[7]_XDMAC_CSA_SA_SHIFT		0
#define XDMAC_XDMAC_CHID[7]_XDMAC_CSA_SA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[7]_xdmac_csa_sa SA Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cda XDMACCHID[7]XDMACCDA Channel Destination Address Register
@{*/


#define XDMAC_XDMAC_CHID[7]_XDMAC_CDA_DA_SHIFT		0
#define XDMAC_XDMAC_CHID[7]_XDMAC_CDA_DA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[7]_xdmac_cda_da DA Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cnda XDMACCHID[7]XDMACCNDA Channel Next Descriptor Address Register
@{*/


#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDA_NDA_SHIFT		2
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDA_NDA_MASK		0x3fffffff
/** @defgroup xdmac_xdmac_chid[7]_xdmac_cnda_nda NDA Channel x Next Descriptor Address
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDA_NDAIF Channel x Next Descriptor Interface **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDA_NDAIF		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cndc XDMACCHID[7]XDMACCNDC Channel Next Descriptor Control Register
@{*/


#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDVIEW_SHIFT		3
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDVIEW_MASK		0x03
/** @defgroup xdmac_xdmac_chid[7]_xdmac_cndc_ndview NDVIEW Channel x Next Descriptor View
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDDUP Channel x Next Descriptor Destination Update **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDDUP		(1 << 2)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDSUP Channel x Next Descriptor Source Update **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDSUP		(1 << 1)
/** XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDE Channel x Next Descriptor Enable **/
#define XDMAC_XDMAC_CHID[7]_XDMAC_CNDC_NDE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cubc XDMACCHID[7]XDMACCUBC Channel Microblock Control Register
@{*/


#define XDMAC_XDMAC_CHID[7]_XDMAC_CUBC_UBLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[7]_XDMAC_CUBC_UBLEN_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[7]_xdmac_cubc_ublen UBLEN Channel x Microblock Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[7]_xdmac_cbc XDMACCHID[7]XDMACCBC Channel Block Control Register
@{*/


