grevaillot/svd_tools/headers/ATSAMV71Q20B/xdmac.h
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_ROIS Request Overflow Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_ROIS		(1 << 6)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_WBEIS Write Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_WBEIS		(1 << 5)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_RBEIS Read Bus Error Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_RBEIS		(1 << 4)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_FIS End of Flush Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_FIS		(1 << 3)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_DIS End of Disable Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_DIS		(1 << 2)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_LIS End of Linked List Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_LIS		(1 << 1)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CIS_BIS End of Block Interrupt Status Bit **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CIS_BIS		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_csa XDMACCHID[8]XDMACCSA Channel Source Address Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CSA_SA_SHIFT		0
#define XDMAC_XDMAC_CHID[8]_XDMAC_CSA_SA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[8]_xdmac_csa_sa SA Channel x Source Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cda XDMACCHID[8]XDMACCDA Channel Destination Address Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CDA_DA_SHIFT		0
#define XDMAC_XDMAC_CHID[8]_XDMAC_CDA_DA_MASK		0xffffffff
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cda_da DA Channel x Destination Address
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cnda XDMACCHID[8]XDMACCNDA Channel Next Descriptor Address Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDA_NDA_SHIFT		2
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDA_NDA_MASK		0x3fffffff
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cnda_nda NDA Channel x Next Descriptor Address
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDA_NDAIF Channel x Next Descriptor Interface **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDA_NDAIF		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cndc XDMACCHID[8]XDMACCNDC Channel Next Descriptor Control Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDVIEW_SHIFT		3
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDVIEW_MASK		0x03
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cndc_ndview NDVIEW Channel x Next Descriptor View
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDDUP Channel x Next Descriptor Destination Update **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDDUP		(1 << 2)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDSUP Channel x Next Descriptor Source Update **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDSUP		(1 << 1)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDE Channel x Next Descriptor Enable **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CNDC_NDE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cubc XDMACCHID[8]XDMACCUBC Channel Microblock Control Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CUBC_UBLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[8]_XDMAC_CUBC_UBLEN_MASK		0xffffff
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cubc_ublen UBLEN Channel x Microblock Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cbc XDMACCHID[8]XDMACCBC Channel Block Control Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CBC_BLEN_SHIFT		0
#define XDMAC_XDMAC_CHID[8]_XDMAC_CBC_BLEN_MASK		0xfff
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cbc_blen BLEN Channel x Block Length
@{*/
/**@}*/


/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc XDMACCHID[8]XDMACCC Channel Configuration Register
@{*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_PERID_SHIFT		24
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_PERID_MASK		0x7f
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_perid PERID Channel x Peripheral Hardware Request Line Identifier
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_WRIP Write in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_WRIP		(1 << 23)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_RDIP Read in Progress (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_RDIP		(1 << 22)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_INITD Channel Initialization Terminated (this bit is read-only) **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_INITD		(1 << 21)

#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DAM_SHIFT		18
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_dam DAM Channel x Destination Addressing Mode
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_SAM_SHIFT		16
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_SAM_MASK		0x03
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_sam SAM Channel x Source Addressing Mode
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_DIF Channel x Destination Interface Identifier **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DIF		(1 << 14)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_SIF Channel x Source Interface Identifier **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_SIF		(1 << 13)

#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DWIDTH_SHIFT		11
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DWIDTH_MASK		0x03
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_dwidth DWIDTH Channel x Data Width
@{*/
/**@}*/


#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_CSIZE_SHIFT		8
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_CSIZE_MASK		0x07
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_csize CSIZE Channel x Chunk Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_MEMSET Channel x Fill Block of memory **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_MEMSET		(1 << 7)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_SWREQ Channel x Software Request Trigger **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_SWREQ		(1 << 6)
/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_DSYNC Channel x Synchronization **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_DSYNC		(1 << 4)

#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_MBSIZE_SHIFT		1
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_MBSIZE_MASK		0x03
/** @defgroup xdmac_xdmac_chid[8]_xdmac_cc_mbsize MBSIZE Channel x Memory Burst Size
@{*/
/**@}*/

/** XDMAC_XDMAC_CHID[8]_XDMAC_CC_TYPE Channel x Transfer Type **/
#define XDMAC_XDMAC_CHID[8]_XDMAC_CC_TYPE		(1 << 0)

/**@}*/

/** @defgroup xdmac_xdmac_chid[8]_xdmac_cds_msp XDMACCHID[8]XDMACCDSMSP Channel Data Stride Memory Set Pattern
@{*/


